example/request-2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ls="http://bmstu.ru/logsearch">
    <soapenv:Header/>
    <soapenv:Body>
        <ls:SearchInfo>
            <ls:regularExpression>Warning</ls:regularExpression>
            <ls:DateIntervals>
                <ls:dateFrom>2020-01-01T00:00:00</ls:dateFrom>
                <ls:dateTo>2021-12-31T00:00:00</ls:dateTo>
            </ls:DateIntervals>
            <ls:location>/home/anomaly/software/wls12130/user_projects/domains/mydomain/servers/myserver/logs</ls:location>
            <ls:realization>true</ls:realization>
            <ls:fileExtension>XML</ls:fileExtension>
        </ls:SearchInfo>
    </soapenv:Body>
</soapenv:Envelope>
